Revit 2026 API

# ImageExportOptionsViewName Property

---

The name of the view to be created.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public string ViewName { get; set; }
```
```vb
Public Property ViewName As String
	Get
	Set
```
```cpp
public:
property String^ ViewName {
	String^ get ();
	void set (String^ value);
}
```
```fsharp
member ViewName : string with get, set
```

#### Property Value

String

| Exception | Condition |
| --- | --- |
| ArgumentNullException | When setting this property: A non-optional argument was null |

This field is used only to save an image to a project as a new view.

#### Reference

ImageExportOptions Class

Autodesk.Revit.DB Namespace